Revit 2024 API
Arc.XDirection Property
Returns the X direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ XDirection { get; }
Visual Basic
Public ReadOnly Property XDirection As XYZ
	Get
Visual C++
public:
property XYZ^ XDirection {
	XYZ^ get ();
}
See Also
Arc Class
Autodesk.Revit.DB Namespace